{
    "Какой из следующих языков программирования является строго типизированным?": "Java",
    "Какой оператор используется для объявления переменной в JavaScript?": "Все вышеперечисленные",
    "Какой принцип ООП подразумевает сокрытие деталей реализации?": "Инкапсуляция",
    "Что делает оператор finally в конструкции try-catch?": "Выполняется всегда после try и catch",
    "Какой алгоритм сортировки имеет худшую временную сложность O(n²)?": "BubbleSort",
    "Какой из следующих типов данных в Python является изменяемым?": "List",
    "Какой из перечисленных алгоритмов является жадным?": "Алгоритм Дейкстры",
    "Как называется механизм автоматического управления памятью в языках программирования, таких как Java и Python?": "Сборщик мусора",
    "Какой язык программирования используется для разработки под iOS?": "Swift",
    "Какой файл содержит основные настройки Android-приложения?": "AndroidManifest.xml",
    "Какой инструмент используется для управления зависимостями в Android?": "Gradle",
    "Как называется система для построения пользовательского интерфейса в Jetpack Compose?": "Declarative UI",
    "Какой метод запускает новую активность в Android?": "startActivity()",
    "Какой из фреймворков предназначен для кроссплатформенной мобильной разработки?": "Flutter",
    "Как называется компонент Android, который управляет пользовательским интерфейсом?": "Activity",
    "В каком файле указывается минимальная версия Android, поддерживаемая приложением?": "AndroidManifest.xml",
    "Какой SQL-запрос используется для получения данных из таблицы?": "SELECT",
    "Какой формат данных наиболее популярен для передачи данных в REST API?": "JSON",
    "Какой HTTP-метод используется для отправки данных на сервер?": "POST",
    "Как называется технология хранения данных локально на мобильном устройстве в Android?": "SharedPreferences",
    "Какая операция в SQL используется для удаления строки из таблицы?": "DELETE",
    "Какой метод HTTP используется для обновления данных на сервере?": "PATCH",
    "Какая система управления базами данных чаще всего используется в мобильной разработке?": "SQLite",
    "Какой инструмент используют для анализа производительности кода?": "Profiler",
    "Как называется процесс улучшения структуры кода без изменения его поведения?": "Рефакторинг",
    "Какой подход позволяет адаптировать приложение под разные экраны?": "Adaptive UI",
    "Какой принцип SOLID помогает избежать жесткой зависимости классов?": "Принцип инверсии зависимостей (DIP)",
    "Как называется методология написания чистого, поддерживаемого и тестируемого кода?": "SOLID",
    "Какой инструмент используется для уменьшения размера APK-файла в Android?": "ProGuard",
    "Какой из инструментов помогает профилировать производительность мобильного приложения?": "Android Profiler"
}